; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v4)
             (pred_6 ?v10 ?v1)
             (pred_4 ?v11 ?v1)
             (pred_10 ?v9 ?v11 )
	     (pred_3 ?v11)
             (pred_5 ?v12)
             (pred_2 ?v10)
             (pred_9 ?v1)
             (pred_1 ?v11)
             (pred_11 ?v10)
             (pred_12 ?v11)
             (pred_8 ))



(:action op_5
:parameters (?v8 ?v7 ?v6 ?v2)
:precondition (and (pred_5 ?v8) (pred_5 ?v7) (pred_2 ?v6) (pred_9 ?v2)
          (pred_7 ?v8 ?v7) (pred_6 ?v6 ?v2)
                   (pred_4 ?v7 ?v2) (pred_3 ?v8) 
                   (pred_1 ?v7) (pred_11 ?v6))
:effect (and  (pred_12 ?v7) (not (pred_1 ?v7))))


(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_5 ?v8) (pred_5 ?v5)
               (pred_3 ?v8) (pred_7 ?v8 ?v5) (pred_12 ?v5))
:effect (and (pred_3 ?v5) (not (pred_3 ?v8))))

(:action op_4
:parameters (?v8 ?v6)
:precondition (and (pred_5 ?v8) (pred_2 ?v6) 
                  (pred_3 ?v8) (pred_10 ?v6 ?v8) (pred_8 ))
:effect (and (pred_11 ?v6)
   (not (pred_10 ?v6 ?v8)) (not (pred_8 ))))


(:action op_2
:parameters (?v8 ?v13 ?v3)
:precondition (and (pred_5 ?v8) (pred_2 ?v13) (pred_2 ?v3)
                  (pred_3 ?v8) (pred_11 ?v3) (pred_10 ?v13 ?v8))
:effect (and (pred_11 ?v13) (pred_10 ?v3 ?v8)
        (not (pred_11 ?v3)) (not (pred_10 ?v13 ?v8))))

(:action op_1
:parameters (?v8 ?v6)
:precondition (and (pred_5 ?v8) (pred_2 ?v6) 
                  (pred_3 ?v8) (pred_11 ?v6))
:effect (and (pred_8 ) (pred_10 ?v6 ?v8) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_09 obj_20 obj_03 obj_10 obj_04 obj_01 obj_06 obj_02 obj_16 obj_15 obj_07 obj_18 obj_11 obj_17 obj_12
    obj_05 obj_13
    obj_14 obj_08
    )

    (:init
       (pred_8)

       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_16)
       (pred_5 obj_15)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_12)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_2 obj_14)
       (pred_2 obj_08)

       (pred_7 obj_19 obj_10)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_19)
       (pred_7 obj_04 obj_16)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_10)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_15)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_12 obj_17)
       (pred_1 obj_03)
       (pred_1 obj_18)
       (pred_4  obj_03 obj_05)
       (pred_4  obj_18 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_12 obj_07)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_12)

       (pred_6  obj_14 obj_05)
       (pred_6  obj_08 obj_13)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_08 obj_16)
       (pred_3 obj_11)
    )

    (:goal (and
       (pred_10 obj_08 obj_18)
    ))
(:constraints
  (always (not (pred_3 obj_02)))
)
)

; plan
1. (op_3 obj_11 obj_16)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_16)
   goals met: 0 of 1
2. (op_4 obj_16 obj_08)
   deleted: (pred_10 obj_08 obj_16) (pred_8)
   added: (pred_11 obj_08)
   goals met: 0 of 1
3. (op_3 obj_16 obj_11)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_18 obj_08 obj_13)
   deleted: (pred_1 obj_18)
   added: (pred_12 obj_18)
   goals met: 0 of 1
5. (op_3 obj_11 obj_18)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_18)
   goals met: 0 of 1
6. (op_1 obj_18 obj_08)
   deleted: (pred_11 obj_08)
   added: (pred_8) (pred_10 obj_08 obj_18)
   goals met: 1 of 1
